Repository: KDE/knavalbattle
Catalog: po/*/knavalbattle.po
Languages: eo, ia

# NAME OF TRANSLATORS
source: Your names
eo: Wolfram Diestel,Oliver Kellogg
ia: Giovanni Sora

# EMAIL OF TRANSLATORS
source: Your emails
eo: wolfram@steloj.de,okellogg@users.sourceforge.net
ia: g.sora@tiscali.it

source: Computer
eo: Komputilo
ia: Computator

source: Default hostname for multiplayer games.
eo: Defaŭlta gastiga nomo por plurludantaj ludoj.
ia: Nomine de hospite predefinite per jocos con multe jocatores.

source: Default port for multiplayer games.
eo: Defaŭlta pordo por plurludantaj ludoj.
ia: Porto predefinite per jocos con multe jocatores.

source: User nickname.
eo: Uzanta kromnomo.
ia: Pseudonymo de usator.

source: Whether sound effects should be played.
eo: Ĉu sonefektoj devus esti luditaj.
ia: Si effectos de sono deberea esser reproducite.

source: Allow the ships to be adjacent without one empty space between them.
eo: Permesi la ŝipojn esti apudaj sen unu malplena spaco inter ili.
ia: Permitte que le naves es adjacente sin un vacue spatio inter elles.

source: Allow multiple ships of any size, default: 4 of 1, 3 of 2, 2 of 3, 1 of 4.
eo: Permesi plurajn ŝipojn de ajna grandeco, defaŭlte: 4 el 1, 3 el 2, 2 el 3, 1 el 4.
ia: Permitte multiple naves de omne grandor, predefinite: 4 de 1, 3 de 2, 2 de 3, 1 de 4.

source: Game Toolbar
eo: Luda Ilobreto
ia: Barra de Instrumento de Joco

source: Naval Battle
eo: Mararmea Batalo
ia: Battalia Naval

source: The KDE ship sinking game
eo: La KDE-ŝipsinkiga ludo
ia: Le Joco de submerger naves de KDE

source: Current maintainer
eo: Nuna prizorganto
ia: Mantenitor Currente

source: Project Founder, GUI Handling, Client/Server
eo: Projektfondinto, Grafika interfaco, klient/servo-komunikado
ia: Fundator de projecto, Manear de GUI, Cliente/Servitor

source: Dialog Stuff, Client/Server
eo: Dialogoj, klient-/servo-komunikado
ia: Cosas de Dialogo, Cliente/Servitor

source: Computer Player
eo: Komputila ludanto
ia: Jocator de Computator

source: Game artwork
eo: Ludaj artaĵoj
ia: Material Illustrative (Artwork) de Joco

source: Background
eo: Fono
ia: Fundo

source: Artwork for some of the ships
eo: Artaĵo por kelkaj el la ŝipoj
ia: Material Illustrative (Artwork) pro alcun del naves

source: Welcome screen
eo: Bonvena ekrano
ia: Schermo de benvenite

source: Icon
eo: Piktogramo
ia: Icone

source: Sounds
eo: Sonoroj
ia: Sonos

source: Non-Latin1 Support
eo: Subteno por signaroj aliaj ol ISO-8859-1
ia: Supporto Non-Latin1

source: Various improvements
eo: Diversaj plibonigoj
ia: Varie melioramentos

source: Various improvements and bugfixes
eo: Diversaj plibonigoj kaj korektoj
ia: Varie melioramentos e correctiones de errores

source: Bugfixes and refactoring
eo: Erarkorektoj kaj refactoring
ia: Correctiones de errores e refactorization

source: DNS-SD discovery
eo: Malkovro per DNS-SD
ia: Discoperta de DNS-SD

source: Porting to KGameRenderer and QGraphicsView
eo: Portado al KGameRenderer kaj QGraphicsView
ia: Portar a KGameRenderer e QGraphicsView

source: URL of a Naval Battle game server to connect to after startup
eo: URL de Naval Battle-ludservilo al kiu konektiĝi post ekfunkciiĝo
ia: URL de un servitor de joco de Battalia Naval ubi connecter post le initio

source: &Single Player
eo: &Sola ludanto

source: &Host Game...
eo: &Gastigi Ludon...

source: &Connect to Game...
eo: &Konekti al Ludo...

source: Change &Nickname...
eo: Ŝanĝi Ali&nomon...

source: &Play Sounds
eo: &Ludu sonorojn

source: &Adjacent Ships
eo: &Apudaj Ŝipoj

source: &Multiple Ships
eo: &Multoblaj Ŝipoj

source: Show End-of-Game Message
eo: Montri mesaĝon pri la fino de la ludo

source: Show &Left Grid
eo: Montri Ma&ldekstran Kradon

source: Show &Right Grid
eo: Montri Dekst&ran Kradon

source: &Nickname:
eo: Ali&nomo:
ia: Pseudon&ymo:

source: &Join game:
eo: Aliĝi al lu&do:
ia: Uni a &Joco:

source: &Hostname:
eo: &Komputilnomo:
ia: Nomine de &Hospite:

source: &Port:
eo: &Pordo:
ia: &Porto:

source: &Enter server address manually
eo: &Enigi serviladreson permane

source: Network Parameters
eo: Retaj Parametroj

source: Connecting to remote host...
eo: Konektante al fora gastiganto...

source: Waiting for an incoming connection...
eo: Atendante alvenantan konekton...

source: Could not connect to host
eo: Ne eblis konekti al gastiganto
ia: Il non pote continger a hospite

source: You have
eo: Vi havas
ia: Tu ha

source: You can place ships adjacent to each other
eo: Vi povas meti ŝipojn unu apud la alia
ia: Tu pote placiar naves adjacente a cata altere

source: You must leave a space between ships
eo: Vi devas lasi spacon inter ŝipoj
ia: Tu debe lassar un spatio inter naves

source: Your opponent is now known as %1
eo: Via kontraŭulo nun estas konata kiel %1
ia: Tu adversario es nunc cognoscite como %1

source: Your opponent disconnected from the game
eo: Via kontraŭulo malkonektiĝis de la ludo
ia: Tu adversario se disconnecteva ex le joco

source: Shots
eo: Pafoj
ia: Colpos

source: Hits
eo: Trafoj
ia: Successos

source: Misses
eo: Maltrafoj
ia: Colpos Mancate

source: You win!
eo: Vi gajnas!
ia: Tu Gania!

source: You win. Excellent!
eo: Vi gajnas. Bonega!
ia: Tu Gania. Excellente!

source: You lose.
eo: Vi perdas.
ia: Tu perde.

source: You lose. Better luck next time!
eo: Vi perdas. Pli bona sorto venontfoje!
ia: Tu perde. Melior fortuna le proxime vice.

source: Change Nickname
eo: Ŝanĝi Kromnomon

source: Enter new nickname:
eo: Enigu novan kromnomon:

source: Restart game
eo: Rekomenci ludon

source: Your opponent has requested to restart the game. Do you accept?
eo: Via kontraŭulo petis rekomenci la ludon. Ĉu vi akceptas?
ia: Tu adversario ha requirite reinitiar le joco. Tu accepta?

# @action:button
source: Accept
eo: Akcepti
ia: Accepta

# @action:button
source: Reject
eo: Malakcepti
ia: Rejecta

source: Your opponent is using a pre-KDE4 version of Naval Battle. Note that, according to the rules enforced by old clients, ships cannot be placed adjacent to one another and only one ship of each size is allowed.
eo: Via kontraŭulo uzas antaŭ-KDE4-version de Naval Battle. Notu ke, laŭ la reguloj devigitaj de malnovaj klientoj, ŝipoj ne povas esti metitaj unu apud la alia kaj nur unu ŝipo de ĉiu grandeco estas permesita.
ia: Tu adversario es usante un version pre-KDE4 de Battalia Naval. Tu nota que secunde le regulas enfortiate per vetere clientes, naves non pote esser placiate adjacente a on alteres e solmente un nave per cata grandor es permittite.

source: Enemy has shot. Shoot now!
eo: Malamiko pafis. Pafu nun!
ia: Inimico ha titate. Tira nunc!

source: Waiting for enemy to shoot...
eo: Atendante la pafon de la kontraŭulo...

source: Ships placed. Now shoot on the enemy field!
eo: Ŝipoj metitaj. Nun pafu sur la malamikan kampon!
ia: Naves placiate.Nunc tu tira su le campo del inimico!

source: Waiting for other player to start the game...
eo: Atendante ke alia ludanto komencos la ludon...

source: Waiting for other player to place his ships...
eo: Atendante ke alia ludanto metos siajn ŝipojn...

source: Place your %1 ships. Use the right mouse button to rotate them.
eo: Metu viajn %1 ŝipojn. Uzu la dekstran musbutonon por turni ilin.
ia: Placia tu %1 naves. Usa le button dextere de mus per rotar los.

source: You can't place your remaining ships.
eo: Vi ne povas meti viajn ceterajn ŝipojn.
ia: Tu non pote placiar tu naves remanente.

# @action
source: Restart
eo: Rekomenci

# @action
source: Abort
eo: Ĉesigi

source: You can't place your remaining ships. Please restart placing ships or abort game
eo: Vi ne povas meti viajn ceterajn ŝipojn. Bonvolu rekomenci meti ŝipojn aŭ ĉesigi ludon
ia: Tu non pote placiar tu naves remanente. Pro favor tu reinitiaplaciar naves o abandona le joco

source: Restart placing ships
eo: Rekomenci meti ŝipojn

source: Single Player
eo: Sola ludanto

source: Host Network Game
eo: Gastiga Retludo

source: Connect to Network Game
eo: Konekti al Reta Ludo

source: Remote player
eo: Fora ludanto
ia: Jocator remote

# @action
source: &Single Player
ia: Jocator &Singule

# @action
source: &Host Game…
ia: Joco de &Hospite...

# @action
source: &Connect to Game…
ia: &Connecte a Joco ...

# @action
source: Change &Nickname…
ia: Cambia pseudo&nymo...

# @option:check
source: Play Sounds
ia: Reproduce sonos

# @option:check
source: &Adjacent Ships
ia: Naves &Adjacente

# @option:check
source: &Multiple Ships
ia: Naves &Multiple

# @option:check
source: Show End-of-Game Message
ia: Monstra Message de Fin de Joco

# @option:check
source: Show &Left Grid
ia: Monstra Grillia &Sinistre

# @option:check
source: Show &Right Grid
ia: Monstra Grillia &Dextere

# @action:button
source: &Enter Server Address Manually
ia: Ins&erta adresse de servitor manualmente

# @title:window
source: Network Parameters
ia: Parametros de rete

source: Connecting to remote host…
ia: Connectente a hospite remote...

source: Waiting for an incoming connection…
ia: Attendente un connexion in arrivata...

# @title:window
source: Change Nickname
ia: Cambia pseudonymo

# @label:textbox
source: Enter new nickname:
ia: Inserta nove pseudonymo:

# @title:window
source: Restart Game
ia: Reinitia le joco

source: Waiting for enemy to shoot…
ia: Expectante que le inimico tira...

source: Waiting for other player to start the game…
ia: Expectante que le altere jocator initia le joco...

source: Waiting for other player to place his ships…
ia: Expectante que le altere jocator placia su naves...

# @action:button
source: Restart
ia: Re-Initia

# @action:button
source: Abort
ia: Aborta

# @title:window
source: Restart Placing Ships
ia: Reinitia placiar naves

# @action:button
source: Single Player
ia: Jocator singule

# @action:button
source: Host Network Game
ia: Joco de Rete de Hospite

# @action:button
source: Connect to Network Game
ia: Connecte a Joco de Rete
